sysbench/results/aws/mysql/big/parallel/delete_2.txt
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           10
        other:                           279809
        total:                           279819
    transactions:                        279819 (4469.97 per sec.)
    queries:                             279819 (4469.97 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      4469.9716
    time elapsed:                        62.5997s
    total number of events:              279819

Latency (ms):
         min:                                    0.13
         avg:                                   10.72
         max:                                   76.48
         95th percentile:                       20.37
         sum:                              2999947.54

Threads fairness:
    events (avg/stddev):           5596.3800/79.28
    execution time (avg/stddev):   59.9990/0.01